-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Янв 26 2019 г., 09:16
-- Версия сервера: 5.7.23
-- Версия PHP: 7.1.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `php_course`
--

-- --------------------------------------------------------

--
-- Структура таблицы `posts`
--

DROP TABLE IF EXISTS `posts`;
CREATE TABLE `posts` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `picture_name` varchar(60) DEFAULT NULL,
  `name` varchar(255) NOT NULL,
  `description` varchar(255) NOT NULL,
  `article` varchar(2000) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `posts`
--

REPLACE INTO `posts` (`id`, `user_id`, `picture_name`, `name`, `description`, `article`) VALUES
(22, 3, '4e351f901202166dc3658a4d07f25671.jpg', 'Мужская ответственность. Что это? (глазами мужчины)1', 'Когда я смотрю на женщину рядом с мужчиной, и вижу, как она радостна, расслаблена и БЕЗЗАБОТНА, то у меня есть две версии. Она счастлива со своим мужем, либо она совсем недавно познакомилась с мужчиной и безмерно влюблена. И то и другое прекрасно.', 'Первое – это ТО САМОЕ, второе — искренняя надежда в своего избранника.\r\n\r\nТо, как выглядит наша Любимая – это нам подсказка небес. А её настроение – это половина нашего успеха в жизни. Вывод – наше мужское ДЕЛО НОМЕР ОДИН — делать свою женщину счастливой, тем самым постоянно быть успешным самому духовно и материально.\r\n\r\nНам не надо стремится поделиться с ней своими еще неокрепшими знаниями и «духовностью». Она не менее духовна, чем мы. Основное знание, которое мы ей можем дать – это чувство доверия, счастья и любви, чувство комфорта…не медитативного покоя в лесу среди комаров под дождем, а именно комфорта. Для начала. То, к чему она привыкла. То, что она пока считает естественным. То, отсутствие чего может ввести её в стресс. А в стрессе женщина неожиданно становится «мужчиной», либо она становится «непонятно кем». В любом случае, мужчине это либо откровенно не нравится, и он отчаянно сопротивляется этому. Либо он забывает, что он мужчина сразу и надолго. «Познание себя» и «надо подумать» вообще не работает. Это глубокий отрыв от жизни, а не познание.\r\n\r\nВ современном мире мы не так быстро мыслим, но чувствуем и проявляем чувства моментально! И входит такой вот «мыслитель» или «обиженный мальчик» в депрессивное состояние. При этом он может даже ходить на работу, даже строить дом, и даже разговаривать с женой о чём-то. Но он перестает быть для Неё мужчиной на всех планах бытия.\r\nОна может искренне верить умом, что всё изменится, и он снова вернется. Но в то же время женщина где-то на уровне души точно знает, что мужчина – это Начало. А она ТО, РАДИ ЧЕГО это начало. И это вот «начало» полностью забило на её потребности. Да, у нее есть потребности! И они не в аскезе. И не в экстремальном проживании в палатке, и не в автостопе на 5000 км. Ведь женщину делает женственной именно мужчина — мужская забота, внимание и обеспечение ВСЕГО уровня ЕЁ жизни! Он ответственность берёт за ее жизнь. Это, вообще, его ДЕЛО НОМЕР ДВА – БРАТЬ ОТВЕТСТВЕННОСТЬ.'),
(23, 3, 'a8a141a2a1398e06665ecefc524369fa.jpg', 'Мужская ответственность. Что это? (глазами мужчины)2', 'ДЕЛО НОМЕР ДВА – БРАТЬ ОТВЕТСТВЕННОСТЬ. Мы её легко отдаём, или классно берём за других, только забываем, что надо и ЗА СЕБЯ взять СВОЮ ОТВЕТСТВЕННОСТЬ. Свой ответ держать. Ну и набиваем «шишки» себе и своей Половине.', 'А женщина любит умных мужчин, пространство которых хочется украшать. Умный мужчина тот, кто выбрал свою женщину и заявил ей об этом. Подтвердив действием — женился. Умный мужчина тот, кто видит ВСЕ потребности своей избранницы. И обеспечивает их.\r\nУмный мужчина тот, кто никогда не забывает о вдохновении. А кто его вдохновение? Это Она. Но она НЕ ДАЁТ вдохновение. Она является вдохновением. Мужчине надо помнить ЭТО и жить своей основной жизненной задачей – делать Её счастливой каждый миг.\r\nОпустим общее. Допустим, ты при деле. И постоянно понимаешь, для чего ВСЁ ЭТО. И твоё дело растет всегда. А если не растет, разорился или тебя сократили? Срочно надо вспоминать – для чего ВСЁ ЭТО. Менять всё. Ах тебе уже тридцать, и ты не встретил её. Реально у тебя проблемы. Ты богат и до сих пор не встретил её? Феррари купил? Красавчик! Для кого? А как она узнает, что ты это ВСЁ для НЕЁ делаешь? Надолго тебя хватит? Думай.\r\nНа самом деле ДАЁШЬ ТЫ — это твой «путь самурая». А как только начинаешь давать, то сразу понимаешь для чего ВСЁ ЭТО. До этого ты — «Ёжик в тумане».\r\nТы в этом мире можешь быть счастлив только с Женщиной. Раскрыть себя можешь только с Женщиной. Поднять себя с колен только с Женщиной и ради Женщины.\r\nВАЖНО! Мужики, если женщина стремится к самопознанию (экопоселение, ашрам, йога, голодание, сыроедение), ей сразу надо создать все условия. И пусть познает. В привычной для нее обстановке. Для начала. Где есть комфорт, свет и тепло. Где есть красивое хочу здесь и сейчас. Где есть сладости. Где есть внимание только Ей. Дай ты ей рай в шалаше, но со всеми коммуникациями. Примечание: и полный холодильник. Просто пусть будет. Не понадобится – будет компост.\r\nПусть знает, что Твой бизнес – это для неё. Родовое Поместье для Рода, но без неё на первом месте никак.. Сами понимаете. Твоя книга – для неё, Сад – для неё, Песня для неё. Морду набил за неё. Участок на Луне купил (ну не важно, что по дури купил) – тоже ради неё.'),
(24, 3, '1f131392adabf7110fc3012a1c5e5f09.jpg', 'Мужская ответственность. Что это? (глазами мужчины)3', 'А она видит это, чувствует и даёт тебе ТО, без чего ты не мужчина. Её Мужчина.', 'А ты, создав очередной шедевр, заключив сделку, посадив лес или просто помогая другим, понимаешь – она Твоя Женщина. Она Твоё Всё. И чувствуешь себя Началом.\r\n\r\nИ это проверено на себе и проверяется собой каждый Божий день. И это самая верная ладка по жизни и для Жизни — брать ответственность за свою жизнь (Вы же не забыли, КТО её бОльшая часть) и быть Началом, да еще и постоянно помнить об этом.\r\n\r\nНовичков Сергей'),
(25, 4, '8bcf14187438b54bff147ca15dea162d.jpg', '7 вещей, которые необходимо знать родителям мальчиков!1', 'Любимый ребенок.Гармоничная личность.', '1. Любимый ребенок.\r\n\r\nЕсли родители постоянно дарят своему сыну любовь, заботу и внимание, это дает ребенку ощущение того, что его любят и ждут в окружающем мире. Ребенок, не обделенный теплотой родительских чувств, растет уверенным в себе, дружелюбным, приветливым и ласковым. В противном же случае мальчик принимает эмоциональную холодность родителей, как должное, и учится от них равнодушию. Он растет тревожным, замкнутым, грубым и зажатым.\r\n\r\n2. Гармоничная личность.\r\n\r\nЛюбящие родители, желающие в будущем найти отраду глаз в своем чаде, должны воспитывать в мальчике настоящего Человека и гармоничную личность во всех отношениях. Это значит: воспитывать доброту, сочувствие, умение помогать и приносить пользу другим бескорыстно. Сын должен быть не только «объектом» любви, который потребляет и тратит. Надо принимать его таким, каков он есть, видеть и учитывать его индивидуальность, истинные потребности и способности. Важно развивать эмоциональность, любознательность и повышать уровень знаний ребенка. Разговаривая, обучая, объясняя, мы готовим ребенка к успешному познанию окружающего мира. Помогайте развивать и навыки общения: как знакомиться, слушать, выражать себя.'),
(26, 4, '2d0de8ad8a76487f335b6408a279fe35.jpg', '7 вещей, которые необходимо знать родителям мальчиков!2', 'Самостоятельность и независимость. Физическое развитие.', '3. Самостоятельность и независимость.\r\n\r\nОтдельно хотелось бы сказать о предоставлении ребенку самостоятельности и независимости. Только самостоятельный и свободный человек может быть истинно счастливым и успешным. Предоставляйте сыну возможность делать то, что он хочет делать сам, и то, что он уже умеет делать. Шаг за шагом мальчик будет достигать все больших вершин. С самого раннего возраста мужской натуре присуще стремление к самоутверждению и лидерству. Даже маленький мальчик должен самостоятельно мыслить, иметь свой взгляд на вещи, уметь принимать решения, нести ответственность за свои поступки и быть активным строителем своей жизни. Как этого добиться? Предоставляйте сыну свободу выбора, подключайте его к обсуждению семейных вопросов, а если вы хотите о чем-то попросить сына, говорите не приказами, а предложениями. В противном случае вы можете воспитать послушного, тихого, скромного, безынициативного, безответственного человечка, которому ничего не надо и который ни к чему не стремится.\r\n\r\n4. Физическое развитие.\r\n\r\nДля всех мальчиков необходима двигательная активность и занятия спортом. Совершенствование физических возможностей помогут ребятам почувствовать себя сильными, смелыми, а значит уверенными в своих силах. Поощряйте активные игры и каждодневные физические нагрузки. Совместно составьте небольшую программу занятий. Начните с малого — 1 отжимание от пола, 1 приседание и 1 раз сгибание в животе (пресс), но делать необходимо каждый день. Через неделю по 2 раза и т.д. Сделать это достаточно просто.'),
(27, 4, 'a006693d3fe921f0f1cef921dca851d9.jpg', '7 вещей, которые необходимо знать родителям мальчиков!3', 'Личный пример. Мама и сын.Папа и сын.', '5. Личный пример.\r\n\r\nБез достойного личного примера воспитание ребенка сводится к бесполезным словесным перепалкам и принуждению выполнять родительские команды. Дети с самого рождения «впитывают» все наши «хорошие» и «отрицательные» поступки. Успешные родители — это те, кто постоянно совершенствуют свое родительское мастерство, стараются быть интересными, веселыми, уравновешенными и справедливыми. Родительские взаимоотношения являются для мальчика эталоном обращения с девочками, а в дальнейшем с женщинами и женой. Мама становится для мальчика прообразом его будущей жены.\r\n\r\n6. Мама и сын.\r\n\r\nТак складывается, что в основном воспитанием детей занимаются женщины (мамы, бабушки, воспитатели, учителя), которые когда-то были девочками, но …не мальчиками. Поэтому женская интуиция должна помочь нам попытаться понять мир мальчишеских переживаний. Главное относитесь к своему маленькому мужчине, да и ко всем мужчинам, с уважением, не принижая их статус. Гармоничность воспитания мальчика в большей степени зависит от характера материнского поведения. Мама от природы наделена особой мягкостью и нежностью, ей свойственно быть слабой, нуждающейся в защите и опоре. Сыну с такой мамой волей-неволей приходится вести себя по-мужски (только не забывайте нахваливать своего юного помощника). Замечено, что чаще всего, сильные мужчины вырастают у слабых матерей.\r\n\r\n7. Папа и сын.\r\n\r\nБлиже к 6 годам мальчики начинают проявлять интерес ко всему мужскому. Они стремятся проводить больше времени с отцом, дядей, дедом, подражая им и имитируя их поведение. Желательно, чтобы отец с раннего возраста занимался сыном и участвовал в вопросах его воспитания. В семье именно отец должен быть проводником норм поведения. В любом случае, после 6 лет отец должен быть активным учителем в жизни своего сына. Только через общение с отцом и другими мужчинами мальчик осваивает азы мужского поведения, способы решения «взрослых» проблем, учится высказывать свое мнение и давать оценку событиям.'),
(28, 2, 'd6b3485c2d095d76f301034fcf029229.jpg', 'Мужчина, за которым хочется идти 1', '«В современном мире многие из нас начинают отношения со списка требований к своему партнеру. Идеальный мужчина должен быть таким-то, идеальная женщина должна быть такой-то.', 'Я не знаю, каким должен быть мужчина рядом со мной, хотя и спрашивают об этом часто. Но знаю точно, что этот человек совсем не идеальный. И уж точно не лучше всех. И еще он мне ничего не должен. Он просто Мужчина, за которым хочется идти.\r\n\r\nМужчина, за которым хочется идти, как и все люди на этой планете, совершает ошибки и время от времени сомневается в себе. Чем-то занимается, пробует новое, иногда падает, потом поднимается и идет дальше. Он не гоняет на гоночном автомобиле по ночному мегаполису в одеждах непобедимого супергероя, не паркует свой вертолет на крыше светящегося небоскреба, не носит в кармане ствол, как «крутые парни» из блокбастеров, не сражает наповал грудой мышц всех длинноногих красавиц в округе. Мне кажется, он самый обычный человек. Просто один из семи миллиардов людей, который просыпается каждое утро, проживает свой день и засыпает до нового рассвета. Такой же как и я. И кровь у него красная. Такая же, как и у всех других людей на планете.'),
(29, 2, '9b6499576ffc1532b3b00afa16976ac9.jpg', 'Мужчина, за которым хочется идти 2', 'Мужчина, за которым хочется идти, много работает. И над собой и над миром в целом. Его не так сильно интересуют отношения, потому что мужчинам хочется спасать мир, в этом их природная функция. А меня это устраивает.', 'Мне есть, чем заняться, пока он спасает мир. Я всегда на связи, всегда иду рядом, всегда в зоне досягаемости. Потому что это моя природная функция. Быть Женщиной. Любить, верить, питать энергией и быть рядом, что бы ни случалось. И еще никогда не обсуждать его ошибки с другими людьми. Потому что женская любовь — это не про обсуждение ошибок. Если это Мужчина, за которым хочется идти, значит, он все делает правильно. ВСЁ. И точка. Он идёт, а я за ним.\r\n\r\nМужчина, за которым хочется идти, иногда ранит своим словом или невниманием. Потом он молчит и думает. Затем просит прощения. От всего сердца. И я его прощаю. Всегда прощаю. Потому что я такая же. Я тоже раню. И тоже прошу прощения. От всего сердца. И он меня прощает. Потому что он такой же. Просто человек, как и все мы на этой планете.\r\n\r\nМужчина, за которым хочется идти, временами устает и уходит в пещеру. Такое случается с мужчинами, за которыми хочется идти. Им хочется уединиться и поразмышлять о жизни. Или просто сходить на футбол. Или посидеть в чайной в одиночестве. И хорошо. Пусть посидит в своей пещере. Отдохнет и обязательно вернется.'),
(30, 2, '3977857ef7437cd167428bb6309f7a7c.jpg', 'Мужчина, за которым хочется идти 3', 'Мужчина, за которым хочется идти, не говорит много о своих чувствах.', 'Однажды он дает тебе понять, что любит, и что ты — важный человек в его жизни. А дальше он просто делает. Не говорит, но делает. Просто что-то делает. Ходит на работу, занимается бизнесом, развивается. Иногда держится на расстоянии, когда-то подходит ближе. Когда подходит, то крепко обнимает. Смотрит в глаза. Ну а ты просто знаешь, что он — Мужчина, за которым хочется идти. И все. Ты просто знаешь это.\r\n\r\nДа нет, это не как в кино. Никаких тебе фейерверков, никаких великих озарений, никаких предсказаний и круглосуточной страсти. Просто родной человек, просто тот, кому ты доверяешь, просто тот, кто верит тебе. Просто человек, с которым тебе хорошо и по-домашнему уютно. Просто Мужчина, за которым хочется идти.\r\n\r\n(Д.Ричардс)');

-- --------------------------------------------------------

--
-- Структура таблицы `signup`
--

DROP TABLE IF EXISTS `signup`;
CREATE TABLE `signup` (
  `user_id` int(11) NOT NULL,
  `username` varchar(60) NOT NULL,
  `login` varchar(60) NOT NULL,
  `password` varchar(60) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `signup`
--

REPLACE INTO `signup` (`user_id`, `username`, `login`, `password`) VALUES
(1, 'jack', 'afedfeg@yoo', '678'),
(2, 'naska', 'dhghk@.yggeff', '123'),
(3, 'sergey', 'dhghk@.ygge', '124'),
(4, 'evgeniy', 'evgeniy@jjp', '777'),
(5, 'dasha', 'userdasha@yoo.com', '555'),
(6, 'dima', 'dima@lll.com', '333');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `signup`
--
ALTER TABLE `signup`
  ADD PRIMARY KEY (`user_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `posts`
--
ALTER TABLE `posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT для таблицы `signup`
--
ALTER TABLE `signup`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `posts`
--
ALTER TABLE `posts`
  ADD CONSTRAINT `posts_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `signup` (`user_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
